src/cf/Catalogs/HotelRooms.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>HotelRooms</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Type</Name>
					<Type>
						<v8:Type>cfg:EnumRef.RoomType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdditionalInformation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.RoomStatus</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Capacity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Used</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CapacityShow</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/HotelBookingHistory.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>HotelBookingHistory</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Room</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.HotelRooms</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Veterinarian</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>EndTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StartTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Duration</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>DogOwner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DogOwners</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Dog</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Dogs</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/HotelRooms/Forms/HotelRoomsStatus/Ext/Form/Module.bsl
&AtClient
Procedure Generate(Command)
	GenerateAtServer();
EndProcedure

&AtServer
Procedure GenerateAtServer()
	If ValueIsFilled(StartDate) then
		If not ValueIsFilled(EndDate) then
			EndDate = StartDate;
		Endif;
		Room.GetItems().Clear();
		Query = New Query;
		Query.Text = 
		"SELECT
		|	HotelBookingHistory.StartTime AS StartTime,
		|	HotelBookingHistory.EndTime AS EndTime,
		|	HotelBookingHistory.Room AS Room,
		|	COUNT(DISTINCT HotelRooms.Description) AS Description
		|FROM
		|	InformationRegister.HotelBookingHistory AS HotelBookingHistory
		|		LEFT JOIN Catalog.HotelRooms AS HotelRooms
		|		ON HotelBookingHistory.Room = HotelRooms.Ref
		|WHERE
		|	(&StartDate BETWEEN HotelBookingHistory.StartTime AND HotelBookingHistory.EndTime
		|				AND (&EndDate BETWEEN HotelBookingHistory.StartTime AND HotelBookingHistory.EndTime)
		|			OR HotelBookingHistory.StartTime = &StartDate
		|			OR HotelBookingHistory.EndTime = &EndDate)
		|	OR HotelBookingHistory.EndTime BETWEEN &StartDate AND &EndDate
		|
		|GROUP BY
		|	HotelBookingHistory.StartTime,
		|	HotelBookingHistory.EndTime,
		|	HotelBookingHistory.Room";
		
		Query.SetParameter("StartDate", StartDate);
		Query.SetParameter("EndDate", EndDate);
		
		QueryResult = Query.Execute();
		
		SelectionDetailRecords = QueryResult.Select();
		PendingRoomCount = 0;
		PendingArr = new Array();
		Pending = Room.GetItems().Add();
		Pending.RoomKinds = "Pending rooms";
		While SelectionDetailRecords.Next() Do
			If PendingArr.Find(SelectionDetailRecords.Room)=undefined then
				PendingRoom = Pending.GetItems().Add();
				PendingRoom.RoomKinds = SelectionDetailRecords.Room;
				PendingRoom.Type = SelectionDetailRecords.Room.Type;
				PendingRoom.Price = SelectionDetailRecords.Room.Price;
				PendingRoomCount = PendingRoomCount+1;
				PendingArr.Add(SelectionDetailRecords.Room);
			Endif;
		EndDo;
		
		Pending.quantity = PendingRoomCount;
		
		Query = New Query;
		Query.Text = 
		"SELECT
		|	COUNT(DISTINCT HotelRooms.Ref) AS Ref,
		|	HotelRooms.Ref AS Ref1
		|FROM
		|	Catalog.HotelRooms AS HotelRooms
		|
		|GROUP BY
		|	HotelRooms.Ref";
		
		QueryResult = Query.Execute();
		
		SelectionDetailRecords = QueryResult.Select();
		Available = 0;
		AvailableRow = Room.GetItems().Add();
		AvailableRow.Roomkinds = "Available rooms";
		While SelectionDetailRecords.Next() Do
			Available = Available+1;
			If PendingArr.Find(SelectionDetailRecords.Ref1)=undefined then
				AvailableRoom = AvailableRow.GetItems().Add();
				AvailableRoom.RoomKinds = SelectionDetailRecords.Ref1;
				AvailableRoom.Type = SelectionDetailRecords.Ref1.Type;
				AvailableRoom.Price = SelectionDetailRecords.Ref1.Price;
				
				AvailableRoom.Quantity = "";
			Endif;
		EndDo;
		AvailableRow.Quantity = Available -PendingRoomCount; 
	Else 
		Message("Start date can not be empty! ",MessageStatus.VeryImportant);
	EndIf;
EndProcedure
